export default {
  projections: {
    ТЧФактВыпРE: {
      спрНомен: {
        __caption__: 'Номенклатура',
        наименование: {
          __caption__: 'Номенклатура'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрВидыРаб: {
        __caption__: 'Вид работы',
        наименование: {
          __caption__: 'Вид работы'
        }
      },
      спрТранспСр: {
        __caption__: 'Транспортное средство',
        наименование: {
          __caption__: 'Транспортное средство'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Тип транспортного средства',
        наименование: {
          __caption__: 'Тип транспортного средства'
        }
      },
      спрЕдИзмер: {
        __caption__: 'Единицы измерения',
        наименование: {
          __caption__: 'Единицы измерения'
        }
      }
    }
  },
  validations: {
    врПриб: {
      __caption__: 'врПриб'
    },
    врУб: {
      __caption__: 'врУб'
    },
    кдПрост: {
      __caption__: 'кдПрост'
    },
    клЧасНОб: {
      __caption__: 'клЧасНОб'
    },
    колЧасПр: {
      __caption__: 'колЧасПр'
    },
    колЧасРаб: {
      __caption__: 'колЧасРаб'
    },
    обГруз: {
      __caption__: 'обГруз'
    },
    обРаб: {
      __caption__: 'обРаб'
    },
    статЗатр: {
      __caption__: 'статЗатр'
    },
    спрВидыРаб: {
      __caption__: 'Вид работы'
    },
    спрЕдИзмер: {
      __caption__: 'Единицы измерения'
    },
    спрКонтрАг: {
      __caption__: 'Контрагент'
    },
    спрНомен: {
      __caption__: 'Номенклатура'
    },
    спрТипТрансСр: {
      __caption__: 'Тип транспортного средства'
    },
    спрТранспСр: {
      __caption__: 'Транспортное средство'
    },
    фактВыполРаб: {
      __caption__: 'фактВыполРаб'
    }
  }
};
