export default {
  projections: {
    СпрВидыРабE: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      спрЕдИзмер: {
        __caption__: 'Спр ед измер',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Спр тип транс ср',
        описание: {
          __caption__: 'Описание'
        }
      }
    },
    СпрВидыРабL: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      спрЕдИзмер: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Описание',
        описание: {
          __caption__: 'Описание'
        }
      }
    },
    СпрВидыРаботE: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      спрЕдИзмер: {
        __caption__: 'Единицы измерения',
        наименование: {
          __caption__: 'Единицы измерения'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Тип транспортного средства',
        наименование: {
          __caption__: 'Тип транспортного средства'
        }
      }
    },
    СпрВидыРаботL: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      спрЕдИзмер: {
        __caption__: 'Единицы измерения',
        наименование: {
          __caption__: 'Единицы измерения'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Тип транспортного средства',
        наименование: {
          __caption__: 'Тип транспортного средства'
        }
      }
    }
  },
  validations: {
    код: {
      __caption__: 'Код'
    },
    наименование: {
      __caption__: 'Наименование'
    },
    спрЕдИзмер: {
      __caption__: 'Спр ед измер'
    },
    спрТипТрансСр: {
      __caption__: 'Спр тип транс ср'
    }
  }
};
