export default {
  projections: {
    ДокПланЗаНаДE: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрПользов: {
        __caption__: 'Пользователь',
        фИО: {
          __caption__: 'Пользователь'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      }
    },
    ДокПланЗаНаДL: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрПользов: {
        __caption__: 'Пользователь',
        фИО: {
          __caption__: 'Пользователь'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    номер: {
      __caption__: 'Номер'
    },
    спрКонтрАг: {
      __caption__: 'Контрагент'
    },
    спрОбъектСтр: {
      __caption__: 'Объект строительства'
    },
    спрПользов: {
      __caption__: 'Пользователь'
    }
  }
};
