export default {
  projections: {
    ДокПланЗаНаДE: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрПользов: {
        __caption__: 'Пользователь',
        фИО: {
          __caption__: 'Пользователь'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      },
      тЧПлЗНаД: {
        __caption__: 'Плановая заявка на день',
        спрКонтрАг: {
          __caption__: 'Контрагент',
          наименование: {
            __caption__: 'Контрагент'
          }
        },
        спрНомен: {
          __caption__: 'Номенклатура',
          наименование: {
            __caption__: 'Номенклатура'
          }
        },
        спрВидыРаб: {
          __caption__: 'Виды работы',
          наименование: {
            __caption__: 'Виды работы'
          }
        },
        спрТранспСр: {
          __caption__: 'Транспортное средство',
          наименование: {
            __caption__: 'Транспортное средство'
          }
        },
        спрТипТрансСр: {
          __caption__: 'Типы транспортного средства',
          наименование: {
            __caption__: 'Типы транспортного средства'
          }
        }
      }
    },
    ДокПланЗаНаДL: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата'
      },
      время: {
        __caption__: 'Время'
      },
      спрПользов: {
        __caption__: 'Пользователь',
        фИО: {
          __caption__: 'Пользователь'
        }
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрОбъектСтр: {
        __caption__: 'Объект строительства',
        наименование: {
          __caption__: 'Объект строительства'
        }
      }
    }
  },
  validations: {
    время: {
      __caption__: 'Время'
    },
    дата: {
      __caption__: 'Дата'
    },
    номер: {
      __caption__: 'Номер'
    },
    спрКонтрАг: {
      __caption__: 'Контрагент'
    },
    спрОбъектСтр: {
      __caption__: 'Объект строительства'
    },
    спрПользов: {
      __caption__: 'Пользователь'
    },
    тЧПлЗНаД: {
      __caption__: 'Плановая заявка на день'
    }
  }
};
