export default {
  projections: {
    ТЧПлЗНаДE: {
      стЗатрат: {
        __caption__: 'Статья затрат'
      },
      спрКонтрАг: {
        __caption__: 'Контрагент',
        наименование: {
          __caption__: 'Контрагент'
        }
      },
      спрНомен: {
        __caption__: 'Номенклатура',
        наименование: {
          __caption__: 'Номенклатура'
        }
      },
      спрВидыРаб: {
        __caption__: 'Виды работы',
        наименование: {
          __caption__: 'Виды работы'
        }
      },
      обРаб: {
        __caption__: 'Объем работ'
      },
      спрТранспСр: {
        __caption__: 'Транспортное средство',
        наименование: {
          __caption__: 'Транспортное средство'
        }
      },
      спрТипТрансСр: {
        __caption__: 'Типы транспортного средства',
        наименование: {
          __caption__: 'Типы транспортного средства'
        }
      },
      времПриб: {
        __caption__: 'Время прибытия'
      },
      колЧас: {
        __caption__: 'Количество часов работы'
      },
      спрЕдИзмер: {
        __caption__: 'Единицы измерения',
        наименование: {
          __caption__: 'Единицы измерения'
        }
      }
    }
  },
  validations: {
    времПриб: {
      __caption__: 'времПриб'
    },
    колЧас: {
      __caption__: 'колЧас'
    },
    обГруз: {
      __caption__: 'обГруз'
    },
    обРаб: {
      __caption__: 'обРаб'
    },
    стЗатрат: {
      __caption__: 'стЗатрат'
    },
    спрВидыРаб: {
      __caption__: 'спрВидыРаб'
    },
    спрЕдИзмер: {
      __caption__: 'спрЕдИзмер'
    },
    спрКонтрАг: {
      __caption__: 'Контрагент'
    },
    спрНомен: {
      __caption__: 'спрНомен'
    },
    спрТипТрансСр: {
      __caption__: 'спрТипТрансСр'
    },
    спрТранспСр: {
      __caption__: 'спрТранспСр'
    },
    докПланЗаНаД: {
      __caption__: 'докПланЗаНаД'
    }
  }
};
